Revit 2024 API
RebarContainerParameterManager Class
 Provides implementation of RebarContainer parameters overrides.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class RebarContainerParameterManager : IDisposable
Visual Basic
Public Class RebarContainerParameterManager _
	Implements IDisposable
Visual C++
public ref class RebarContainerParameterManager : IDisposable
Remarks
 When a new override is created, by default, the parameter will show the overridden value as read-only. You can control whether or not the parameter is modifiable using SetOverriddenParameterReadonly(ElementId) and SetOverriddenParameterModifiable(ElementId).a
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarContainerParameterManager
See Also
RebarContainerParameterManager Members
Autodesk.Revit.DB.Structure Namespace